import React from 'react';

const Blogs = () => {
    return (
        <div className='grid grid-cols-3 gap-8 container mx-auto mt-11'>
            <div className='p-8 text-center shadow shadow-2xl'>
                <h2 className='text-2xl font-semibold mb-3 text-red-800'>কনটেক্সট এপিআই কি?</h2>
                <p>রিঅ্যাক্ট কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট অ্যাপের জন্য কার্যকরভাবে গ্লোবাল ভেরিয়েবল তৈরি করার একটি উপায়, যা চারপাশে পাস করা যেতে পারে। এটি "প্রপ ড্রিলিং" বা গ্র্যান্ড-প্যারেন্ট থেকে চাইল্ড থেকে প্যারেন্ট এর কাছে প্রপস সরানোর বিকল্প। রিডাক্স ব্যবহার করে স্টেট পরিচালনার জন্য প্রসঙ্গটিকে একটি সহজ, হালকা পদ্ধতি হিসাবেও উল্লেখ করা হয়। কনটেক্সট এপিআই হল রিঅ্যাক্টের ১৬.৩ সংস্করণে যোগ করা একটি (ধরনের) নতুন বৈশিষ্ট্য যা একজনকে পুরো অ্যাপ জুড়ে (বা এটির অংশ) হালকাভাবে এবং স্বাচ্ছন্দ্যে স্থিতি ভাগ করতে দেয়।</p>
            </div>
            <div className='p-8 text-center shadow shadow-2xl'>
                <h2 className='text-2xl font-semibold mb-3 text-red-800'>সিম্যান্টিক ট্যাগ কি?</h2>
                <p>সিম্যান্টিক এইচটিএমএল ট্যাগগুলি সেই ট্যাগের বিষয়বস্তু সম্পর্কে তথ্য প্রদান করে যা একটি পৃষ্ঠায় তারা যেভাবে দেখায় তার বাইরে যায়৷ কোড ট্যাগে আবদ্ধ পাঠ্যটি অবিলম্বে ব্রাউজার দ্বারা কিছু ধরণের কোডিং ভাষা হিসাবে স্বীকৃত হয়। সেই কোডটি রেন্ডার করার চেষ্টা করার পরিবর্তে, ব্রাউজার বুঝতে পারে যে আপনি একটি নিবন্ধ বা অনলাইন টিউটোরিয়ালের উদ্দেশ্যে কোডের উদাহরণ হিসাবে সেই পাঠ্যটি ব্যবহার করছেন৷</p>
            </div>
            <div className='p-8 text-center shadow shadow-2xl'>
                <h2 className='text-2xl font-semibold mb-3 text-red-800'>ইনলাইন, ব্লক এবং ইনলাইন-ব্লক এর মধ্যে পার্থক্য কি?</h2>
                <p>ইনলাইন উপাদানটি একটি নতুন লাইনে শুরু হয় না এবং শুধুমাত্র এটির প্রয়োজনীয় প্রস্থটি দখল করে। আপনি প্রস্থ বা উচ্চতা সেট করতে পারবেন না। ব্লক উপাদানটি একটি নতুন লাইনে শুরু হবে এবং উপলব্ধ পুরো প্রস্থটি দখল করবে। এবং আপনি প্রস্থ এবং উচ্চতা মান সেট করতে পারেন। ইনলাইন-ব্লক এটি ইনলাইন উপাদানের মতো ফর্ম্যাট করা হয়েছে, যেখানে এটি একটি নতুন লাইনে শুরু হয় না। কিন্তু, আপনি প্রস্থ এবং উচ্চতা মান সেট করতে পারেন।</p>
            </div>

        </div>
    );
};

export default Blogs;